Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedBarLoad.EndDistance Property
 The end distance of the decomposed bar load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double EndDistance { get; }
Public ReadOnly Property EndDistance As Double
	Get
Property Value
Type: Double
See Also
Reference
AnalysisDecomposedBarLoad Class
Tekla.Structures.Analysis Namespace